In [23]:
#1 Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [24]:
import pandas as pd
data=[4,8,15, 16,23,42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [25]:
#2 Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

In [26]:
import pandas as pd
my_list=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
pd.Series(my_list)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [27]:
#Create a Pandas DataFrame that contains the following data:
#NameAlice Bob Claire

#Age 25 30 27

#Gender Female  Male Female

In [28]:
import pandas as pd

data={"Name":["Alice","Bob","Claire"],
      "Age":[25,30,27],
      "Gender":["Female","Male", "Female"]
      }
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
#4 What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame in pandas is a two-dimensional, size-mutable, and heterogeneous tabular data structure. It's similar to a table in a relational database or an Excel spreadsheet, where each column can be of a different data type (such as numbers, strings, or dates). DataFrames provide a convenient way to store, manipulate, and analyze data.

On the other hand, a pandas.Series is a one-dimensional labeled array capable of holding data of any type. It's similar to a single column of a DataFrame but lacks the two-dimensional structure.

In [30]:
import pandas as pd

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 22, 24],
    'Grade': ['A', 'B', 'C']
}

df = pd.DataFrame(data)

In [31]:
df

      Name  Age Grade
0    Alice   25     A
1      Bob   22     B
2  Charlie   24     C

In [32]:
import pandas as pd
data=[4,8,15, 16,23,42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [33]:
#5 What are some common functions you can use to manipulate data in a Pandas DataFrame? 
#Can you give an example of when you might use one of these functions?

In [2]:
import pandas as pd
df=pd.read_csv("Titanic.csv")

head() and tail(): These functions allow you to view the first or last N rows of your DataFrame, which is helpful for quickly inspecting the structure of the data.

In [3]:
df.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [4]:
df.tail()

                        Name PClass   Age   Sex  Survived
1308      Zakarian, Mr Artun    3rd  27.0  male         0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0
1310        Zenni, Mr Philip    3rd  22.0  male         0
1311        Lievens, Mr Rene    3rd  24.0  male         0
1312          Zimmerman, Leo    3rd  29.0  male         0

info(): This function provides a summary of the DataFrame's structure, including the data types, non-null counts, and memory usage. It's useful for getting a quick overview of the dataset.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

describe(): This function generates summary statistics of the numerical columns in the DataFrame, such as mean, standard deviation, minimum, maximum, and quartiles.

In [6]:
df.describe()

              Age     Survived
count  756.000000  1313.000000
mean    30.397989     0.342727
std     14.259049     0.474802
min      0.170000     0.000000
25%     21.000000     0.000000
50%     28.000000     0.000000
75%     39.000000     1.000000
max     71.000000     1.000000

In [10]:
a=df.groupby("Sex")

In [11]:
a

In [12]:
a.sum()

/tmp/ipykernel_131/359836184.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  a.sum()

             Age  Survived
Sex
female   8466.17       308
male    14514.71       142

In [14]:
#6 Which of the following is mutable in nature Series, DataFrame, Panel?

Series:
A Series is a one-dimensional labeled array capable of holding data of any type. It's like a column in a spreadsheet or a basic array.
A Series is mutable, which means you can modify its values after it has been created. You can change individual values by assigning new values to specific indices.

In [15]:
import pandas as pd

data = pd.Series([10, 20, 30, 40, 50])

In [16]:
data

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [18]:
data[2] = 35
print("\nModified Series:")
print(data)

Modified Series:
0    10
1    20
2    35
3    40
4    50
dtype: int64

DataFrame:
A DataFrame is a two-dimensional labeled data structure, similar to a table in a relational database or a spreadsheet.
A DataFrame is also mutable. You can modify its values, add or remove columns, and perform various operations on it.

In [19]:
import pandas as pd


data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22]}
df = pd.DataFrame(data)
print("Original DataFrame:")
df

Original DataFrame:

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

In [21]:
# Adding a new column
df['Gender'] = ['Female', 'Male', 'Male']
print("modified dataframe")
df

modified dataframe

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   22    Male

In [23]:
print("Modifying a value in a specific cell")
df.at[1, 'Age'] = 31
df

Modifying a value in a specific cell

      Name  Age  Gender
0    Alice   25  Female
1      Bob   31    Male
2  Charlie   22    Male

In [24]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

 In Python, you can use the pandas library to create a DataFrame using multiple Series. A DataFrame is a 2-dimensional labeled data structure that can hold data of different types. To create a DataFrame using multiple Series, you would first create each Series and then combine them into a DataFrame.

In [ ]:
import pandas as pd

# Creating Series
name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 28])
city_series = pd.Series(['New York', 'San Francisco', 'Los Angeles'])

# Creating a DataFrame using the Series
data = {'Name': name_series, 'Age': age_series, 'City': city_series}
df = pd.DataFrame(data)

# Displaying the DataFrame
print(df)